tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "steipete/tap"
tap "steveyegge/beads"

brew "zstd"
brew "libtiff"
brew "aws-sso-util"
brew "cfssl"
brew "colordiff"
brew "coreutils"
brew "diffutils"
brew "docker-completion", link: false
brew "python@3.11"
brew "eye-d3"
brew "harfbuzz"
brew "tesseract"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "gdk-pixbuf"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "grep"
brew "jadx"
brew "jq"
brew "kubernetes-cli"
brew "launchctl-completion"
brew "librsvg"
brew "make"
brew "nmap"
brew "nvm"
brew "openssh"
brew "openssl@1.1"
brew "pandoc"
brew "pipx"
brew "pnpm"
brew "python@3.10"
brew "rtk"
brew "thefuck"
brew "wget"
brew "yt-dlp"
brew "steveyegge/beads/bd"

cask "1password-cli"
cask "altair-graphql-client"
cask "android-studio"
cask "aws-vault-binary"
cask "basictex"
cask "beekeeper-studio"
cask "docker-desktop"
cask "font-fira-code"
cask "gcloud-cli"
cask "ghostty"
cask "goldencheetah"
cask "graphql-playground"
cask "iterm2"
cask "llamachat"
cask "ngrok"
cask "openscad"
cask "orbstack"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "sequel-ace"
cask "signal"
cask "zoom"

vscode "abumalick.vscode-nvm"
vscode "adpyke.vscode-sql-formatter"
vscode "akamud.vscode-theme-onedark"
vscode "anthropic.claude-code"
vscode "apollographql.vscode-apollo"
vscode "attilabuti.vscode-mjml"
vscode "christian-kohler.path-intellisense"
vscode "danielsanmedium.dscodegpt"
vscode "dbaeumer.vscode-eslint"
vscode "dedsec727.jekyll-run"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "euskadi31.json-pretty-printer"
vscode "file-icons.file-icons"
vscode "ginfuru.ginfuru-vscode-jekyll-syntax"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "idleberg.openvpn"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "letrieu.expand-region"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "magicstack.magicpython"
vscode "mechatroner.rainbow-csv"
vscode "mrmlnc.vscode-lebab"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.makefile-tools"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "ortoni.ortoni"
vscode "peaceshi.syntax-highlight"
vscode "raillyhugo.one-hunter"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "shakram02.bash-beautify"
vscode "sst-dev.opencode"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "wmaurer.change-case"
vscode "yzhang.markdown-all-in-one"
