# Font
tap "homebrew/cask-fonts"
cask "font-fira-code"

# Finder file previews
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"

# Various and sundry other helpful items
cask "iterm2"
cask "docker"
cask "ngrok"
cask "graphql-playground"
cask "altair-graphql-client"
cask "google-cloud-sdk"
cask "signal"

# Shell Utils
brew "jq"
brew "colordiff"
brew "diffutils"
brew "launchctl-completion"