# Font
tap "homebrew/cask-fonts"
cask "font-fira-code"

# Finder file previews
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"

# Various and sundry other helpful items
cask "iterm2"
cask "docker"
cask "orbstack"
cask "ngrok"
cask "1password/tap/1password-cli"
cask "graphql-playground"
cask "altair-graphql-client"
cask "google-cloud-sdk"
cask "signal"
# the ARM64 fork+sequel to `sequel-pro`
cask "sequel-ace"
cask "zoom"

brew "pnpm"
brew "pipx"
brew "python3", link: true
# brew "llm"

# Shell Utils
brew "jq"
brew "colordiff"
brew "diffutils"
brew "launchctl-completion"
brew "openssh", link: true
brew "openssl"
brew "fzf"
brew "thefuck"

# Needed by rumbleship workstation
brew "wget"

# GNU tools that overwrite Mac tools 
# (largely needed by rumbleship workstation )
brew "coreutils"
brew "findutils"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "grep"
brew "make"