abumalick.vscode-nvm
adpyke.vscode-sql-formatter
akamud.vscode-theme-onedark
anthropic.claude-code
apollographql.vscode-apollo
attilabuti.vscode-mjml
christian-kohler.path-intellisense
danielsanmedium.dscodegpt
dbaeumer.vscode-eslint
dedsec727.jekyll-run
eamodio.gitlens
esbenp.prettier-vscode
euskadi31.json-pretty-printer
file-icons.file-icons
ginfuru.ginfuru-vscode-jekyll-syntax
github.copilot-chat
github.vscode-github-actions
golang.go
hashicorp.terraform
idleberg.openvpn
jeff-hykin.better-dockerfile-syntax
letrieu.expand-region
llvm-vs-code-extensions.lldb-dap
magicstack.magicpython
mechatroner.rainbow-csv
mrmlnc.vscode-lebab
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-playwright.playwright
ms-python.black-formatter
ms-python.debugpy
ms-python.flake8
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode.makefile-tools
octref.vetur
oderwat.indent-rainbow
ortoni.ortoni
peaceshi.syntax-highlight
raillyhugo.one-hunter
redhat.vscode-yaml
rust-lang.rust-analyzer
shakram02.bash-beautify
sst-dev.opencode
swiftlang.swift-vscode
tamasfe.even-better-toml
tomoki1207.pdf
wmaurer.change-case
yzhang.markdown-all-in-one
